azemoh.one-monokai
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
docker.docker
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
fabiospampinato.vscode-diff
file-icons.file-icons
formulahendry.auto-rename-tag
google.geminicodeassist
gruntfuggly.todo-tree
hediet.vscode-drawio
humao.rest-client
hurly.sqltools-oracle-driver
juhahinkula.thymeleaf
llvm-vs-code-extensions.lldb-dap
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-wsl
ms-vscode.hexeditor
mtxr.sqltools
mtxr.sqltools-driver-mysql
mtxr.sqltools-driver-pg
mtxr.sqltools-driver-sqlite
nrwl.angular-console
oderwat.indent-rainbow
redhat.java
saoudrizwan.claude-dev
sgryjp.japanese-word-handler
shengchen.vscode-checkstyle
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
stylelint.vscode-stylelint
swiftlang.swift-vscode
usernamehw.errorlens
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
vscode-icons-team.vscode-icons
vscodevim.vim
wallabyjs.quokka-vscode
